# SchemaBuilder Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SchemaBuilder Properties
SchemaBuilder Class See Also
---
The SchemaBuilder type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace